src/Documents/ЗаказКодовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗаказКодовМаркировки</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказПоставщику</xr:Item>
				<xr:Item>Document.ВводВОборотКодовМаркировки</xr:Item>
				<xr:Item>Document.Перемаркировка</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.Перемаркировка</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводВОборотКодовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговораСОператором</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоговораСОператором</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПроизводственногоЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособВыпускаВОборот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыВыпускаВОборот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВвозПослеДатыОбязательнойМаркировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриобретенПослеНачалаМаркировки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыДокументовМаркировки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаказа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсобенностьУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсобенностиУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GTIN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТовара</Name>
							<Comment>Код товара в личном кабинете</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РозничнаяЦена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособЗаполненияСерийногоНомера</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыЗаполненияСерийногоНомера</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерии</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодТНВЭД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВыпускаВОборот</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВыпускаВОборот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТоварныйЗнак</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокГодности</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦелевойПол</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ЦелевойПол</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособВыпускаТоваровВОборот</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыВыпускаВОборот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВозрастнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВозврастныеКатегории</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СерийныеНомераКодовМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СерийныйНомерМаркировки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>Штрихкоды объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновнойШтрихкод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Действия с этим объектом запрещены</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Короб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Comment>Штрихкод</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, которому принадлежит штрихкод (номенклатура, карточка, документ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыДокументовМаркировки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СтатусыДокументовМаркировки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленЗапросGTIN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноЗаполненGTIN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолностьюЗаполненGTIN</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АннулированаОтгрузка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СпособыВыпускаВОборот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыВыпускаВОборот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортВРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркировкаОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрансграничнаяТорговля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемаркировка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СпособыВводаВОборот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыВводаВОборот</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизводствоВнеЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КонтактноеПроизводствоРФ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолучениеОтФизическихЛиц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрансграничнаяТорговля</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркировкаОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИмпортФТС</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СпособыЗаполненияСерийногоНомера.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>СпособыЗаполненияСерийногоНомера</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ручной</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автоматически</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ЗаказКодовМаркировки/Ext/ObjectModule.bsl
// Модуль объекта документа "Заказ кодов маркировки"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	ПрефиксацияОбъектовПлатформа.ПриУстановкеНовогоНомера(ЭтотОбъект, СтандартнаяОбработка, Префикс);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	ПродолжитьВыполнение = ОбработкаСобытийДокументаСервер.ОбработкаЗаполнения(
		ЭтотОбъект,
		ДанныеЗаполнения,
		ТекстЗаполнения,
		СтандартнаяОбработка
	);
	Если НЕ ПродолжитьВыполнение Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Автор.Сотрудник;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Статус = ПредопределенноеЗначение("Перечисление.СтатусыДокументовМаркировки.Новый");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИдентификаторПроизводственногоЗаказа) Тогда
		ИдентификаторПроизводственногоЗаказа = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		
		Товары.Очистить();
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ЗаказПоставщикуТовары.Номенклатура КАК Номенклатура,
		|	ЗаказПоставщикуТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
		|ИЗ
		|	Документ.ЗаказПоставщику.Товары КАК ЗаказПоставщикуТовары
		|ГДЕ
		|	ЗаказПоставщикуТовары.Ссылка = &Ссылка
		|";
		               //|	И ЗаказПоставщикуТовары.Номенклатура.ТипНоменклатуры.ВедетсяМаркировка";
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
		
		ТаблицаТоваров = Запрос.Выполнить().Выгрузить();
		
		Товары.Загрузить(ТаблицаТоваров);
		
		СпособВыпускаВОборот = ПредопределенноеЗначение("Перечисление.СпособыВыпускаВОборот.ИмпортВРФ");
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВводВОборотКодовМаркировки") Тогда
		
		Если ДанныеЗаполнения.СпособВводаВОборот = Перечисления.СпособыВводаВОборот.МаркировкаОстатков Тогда
			СпособВыпускаВОборот = Перечисления.СпособыВыпускаВОборот.МаркировкаОстатков;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Перемаркировка") Тогда
		
		СпособВыпускаВОборот = Перечисления.СпособыВыпускаВОборот.Перемаркировка;
		
		Товары.Очистить();
		
		Для Каждого ТекущаяСтрока Из ДанныеЗаполнения.Товары Цикл
			Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.КодМаркировкиНовый) Тогда
				НоваяСтрока = Товары.Добавить();
				НоваяСтрока.Номенклатура = ТекущаяСтрока.НоменклатураНовая;
				НоваяСтрока.ХарактеристикаНоменклатуры = ТекущаяСтрока.ХарактеристикаНоменклатурыНовая;
				НоваяСтрока.Количество = 1;
			КонецЕсли;
		КонецЦикла;
		
		Товары.Свернуть("Номенклатура,ХарактеристикаНоменклатуры", "Количество");
		
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.ИдентификаторСтроки) Тогда
			ТекущаяСтрока.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.СпособЗаполненияСерийногоНомера) Тогда
			ТекущаяСтрока.СпособЗаполненияСерийногоНомера = Перечисления.СпособыЗаполненияСерийногоНомера.Автоматически;
		КонецЕсли;
		Документы.ЗаказКодовМаркировки.ТоварыНоменклатураПриИзменении(ЭтотОбъект, ТекущаяСтрока);
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(ОсобенностьУчета) Тогда
		ОсобенностьУчета = МаркировкаТоваровСервер.ОсобенностьУчетаНоменклатуры(Товары.ВыгрузитьКолонку("Номенклатура"));
	КонецЕсли;
	
	// Если больше 10 строк номенклатур, то сформируем несколько заказов
	ДопустимоеЧислоСтрок = 10;
	Если НЕ ДополнительныеСвойства.Свойство("НеПроверятьОграничениеСтрок")
		И Товары.Количество() > ДопустимоеЧислоСтрок Тогда
		
		Документы.ЗаказКодовМаркировки.СформироватьЗаказыНаКодыМаркировки(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда
		Возврат;
	КонецЕсли;
	
	Статус = Перечисления.СтатусыДокументовМаркировки.Новый;
	ИдентификаторПроизводственногоЗаказа = Новый УникальныйИдентификатор;
	ИдентификаторЗаказа = "";
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
	МаркировкаТоваровСервер.НоменклатураСоответствуетОсобенностиУчета(ЭтотОбъект, Отказ);
	
	// Органичения по отправке данных
	ДопустимоеЧислоСтрок = 10;
	Если Товары.Количество() > ДопустимоеЧислоСтрок Тогда
		ВывестиСообщение(НСтр("ru = 'Допускается ввод не более 10 строк.'"), ЭтотОбъект, , , Отказ);
	КонецЕсли;
	
	ЭтоМаркировкаОстатков = 
		СпособВыпускаВОборот = ПредопределенноеЗначение("Перечисление.СпособыВыпускаВОборот.МаркировкаОстатков");
	
	РазныйСпособФормированияНомеров = Ложь;
	ДублированиеGTIN = Новый Массив;
	СписокGTIN  = Новый Массив;
	
	ТекущийСпособГенерацииСерийныхНомеров = Неопределено;
	
	// Проверим количество кодов маркировки в товарах
	ДопустимоеЧислоКодовВСтроке = 150000;
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		Если ТекущаяСтрока.Количество > ДопустимоеЧислоКодовВСтроке Тогда
			ВывестиСообщение(
				НСтр("ru = 'Превышено допустимое количество в строке. Указано больше 150000 кодов.'"),
				ЭтотОбъект,
				"Товары[#].Количество",
				ТекущаяСтрока.НомерСтроки,
				Отказ
			);
		КонецЕсли;
		
		Если ТекущийСпособГенерацииСерийныхНомеров = Неопределено Тогда
			ТекущийСпособГенерацииСерийныхНомеров = ТекущаяСтрока.СпособЗаполненияСерийногоНомера;
		ИначеЕсли ТекущийСпособГенерацииСерийныхНомеров <> ТекущаяСтрока.СпособЗаполненияСерийногоНомера Тогда
			РазныйСпособФормированияНомеров = Истина;
		КонецЕсли;
		
		ПараметрыОтбора = Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки);
		НайденныеСтроки = СерийныеНомераКодовМаркировки.НайтиСтроки(ПараметрыОтбора);
		
		Если
			ТекущаяСтрока.СпособЗаполненияСерийногоНомера = Перечисления.СпособыЗаполненияСерийногоНомера.Ручной
			И ТекущаяСтрока.Количество <> НайденныеСтроки.Количество()
		Тогда
			
			ВывестиСообщение(
				НСтр("ru = 'Несоответствие количества заказываемых кодов маркировки и количества серийных номеров.'"),
				ЭтотОбъект,
				"Товары[#].Количество",
				ТекущаяСтрока.НомерСтроки,
				Отказ
			);
			
		КонецЕсли;
		
		ДлинаШтрихкода = 14;
		Если НЕ ПустаяСтрока(ТекущаяСтрока.GTIN) И СтрДлина(СокрЛП(ТекущаяСтрока.GTIN)) < ДлинаШтрихкода Тогда
			ВывестиСообщение(
				НСтр("ru = 'GTIN должен состоять из 14 символов. Дополните недостающие символы нулями слева'"),
				ЭтотОбъект,
				"Товары[#].GTIN",
				ТекущаяСтрока.НомерСтроки,
				Отказ
			);
		КонецЕсли;
		
		Если ЭтоМаркировкаОстатков Тогда
			
			Если ЗначениеЗаполнено(ТекущаяСтрока.GTIN)
				И СписокGTIN.Найти(ТекущаяСтрока.GTIN) = Неопределено Тогда
				
				НайденныеСтроки = Товары.НайтиСтроки(Новый Структура("GTIN", ТекущаяСтрока.GTIN));
				
				Если НайденныеСтроки.Количество() > 1 Тогда
					Для Каждого СтрокаТовара Из НайденныеСтроки Цикл
						ДублированиеGTIN.Добавить(СтрокаТовара.НомерСтроки);
					КонецЦикла;
					СписокGTIN.Добавить(ТекущаяСтрока.GTIN);
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если РазныйСпособФормированияНомеров Тогда
		ВывестиСообщение(
			НСтр("ru = 'Указаны различные способы генерации серийных номеров. Необходимо привести к одному способу.'"),
			ЭтотОбъект,
			, ,
			Отказ
		);
	КонецЕсли;
	
	Если ДублированиеGTIN.Количество() > 0 Тогда
		Результат = Ложь;
		ТекстСообщения = СтрШаблон(
			НСтр("ru = 'Строки таблицы ""Товары"" не уникальны по значению полей (GTIN). Строки:%1'"),
			СтрСоединить(ДублированиеGTIN, ", ")
		);
		ВывестиСообщение(ТекстСообщения, ЭтотОбъект, , , Отказ);
	КонецЕсли;
	
	ПроверкаКодовМаркировкиОстатковЛегкойПромышленности(Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// Пока заполним серийные номера автоматически
	Для Каждого ТекущаяСтрока Из Товары Цикл
		Если НЕ ЗначениеЗаполнено(ТекущаяСтрока.СпособЗаполненияСерийногоНомера) Тогда
			ТекущаяСтрока.СпособЗаполненияСерийногоНомера = Перечисления.СпособыЗаполненияСерийногоНомера.Автоматически;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПередЗаписью(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления
		И (Статус = Перечисления.СтатусыДокументовМаркировки.Отправлен
		ИЛИ Статус = Перечисления.СтатусыДокументовМаркировки.Выполнен) Тогда
		
		ВывестиСообщение(
			НСтр("ru = 'Заказ на эмиссию кодов маркировки выполнен или отправлен. Данный заказ нельзя удалять.'")
		);
		Отказ = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПриЗаписи(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	//Если НЕ Отказ Тогда
	//	РегистрыСведений.ЖурналСостояний.ЗаписьВЖурналСостояний(Ссылка, Статус);
	//	ЗаписатьНовыеШтрихкоды();
	//КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ПередУдалением(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаУдаленияПроведения(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если НЕ ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ЭтотОбъект, Отказ, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаписатьНовыеШтрихкоды()
	
	НовыеШтрихкоды = Товары.Выгрузить(, "Номенклатура,GTIN,ХарактеристикаНоменклатуры");
	УдалитьСтроки = Новый Массив;
	Для Каждого Строка Из НовыеШтрихкоды Цикл
		Если ЗначениеЗаполнено(Строка.GTIN) И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Строка.GTIN) Тогда
			СтрокаGTIN = Формат(Число(Строка.GTIN), "ЧГ=0");
			Строка.GTIN = ШтрихкодированиеМПКлиентСервер.ШтрихкодEANИзGTIN(СтрокаGTIN);
		Иначе
			УдалитьСтроки.Добавить(Строка);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка Из УдалитьСтроки Цикл
		НовыеШтрихкоды.Удалить(Строка);
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	НовыеШтрихкоды.GTIN КАК Штрихкод,
	|	НовыеШтрихкоды.Номенклатура КАК Номенклатура,
	|	НовыеШтрихкоды.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ПОМЕСТИТЬ ТаблицаШтрихкодов
	|ИЗ
	|	&НовыеШтрихкоды КАК НовыеШтрихкоды
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаШтрихкодов.Штрихкод КАК Штрихкод,
	|	ТаблицаШтрихкодов.Номенклатура КАК Номенклатура,
	|	ТаблицаШтрихкодов.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	ТаблицаШтрихкодов КАК ТаблицаШтрихкодов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	|		ПО ТаблицаШтрихкодов.Штрихкод = Штрихкоды.Штрихкод
	|			И ТаблицаШтрихкодов.Номенклатура = Штрихкоды.Объект
	|ГДЕ
	|	Штрихкоды.Объект ЕСТЬ NULL ИЛИ 
	|	ЕСТЬNULL(Штрихкоды.GTIN, ИСТИНА) = ИСТИНА
	|";
	Запрос.УстановитьПараметр("НовыеШтрихкоды", НовыеШтрихкоды);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			НоваяЗапись = РегистрыСведений.ШтрихКоды.СоздатьМенеджерЗаписи();
			НоваяЗапись.Штрихкод = ШтрихкодированиеМПКлиентСервер.ШтрихкодEANИзGTIN(Выборка.Штрихкод);
			НоваяЗапись.Объект = Выборка.Номенклатура;
			НоваяЗапись.ХарактеристикаНоменклатуры = Выборка.ХарактеристикаНоменклатуры;
			НоваяЗапись.GTIN   = Истина;
			НоваяЗапись.Запрет = Ложь;
			НоваяЗапись.Записать();
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверкаКодовМаркировкиОстатковЛегкойПромышленности(Отказ)
	
	Если НЕ (СпособВыпускаВОборот = Перечисления.СпособыВыпускаВОборот.МаркировкаОстатков
		И ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность) Тогда
		Возврат;
	КонецЕсли;
	
	СписокКодовТНВЭД = ОбщегоНазначения.ЗначениеРеквизитаОбъектов(Товары.ВыгрузитьКолонку("КодТНВЭД"), "Код");
	
	Для Каждого ТекущаяСтрока Из Товары Цикл
		
		КодТНВЭД = СписокКодовТНВЭД.Получить(ТекущаяСтрока.КодТНВЭД);
		
		Если СтрНачинаетсяС(КодТНВЭД, "63")
			И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ВозрастнаяКатегория) Тогда
			
			ВывестиСообщение(
				НСтр("ru = 'Табличная часть Товары. Строка: %1. Не заполнена возрастная категория.'"),
				ЭтотОбъект,
				"Товары[#].ВозрастнаяКатегория",
				ТекущаяСтрока.НомерСтроки,
				Отказ);
			
		ИначеЕсли (СтрНачинаетсяС(КодТНВЭД, "42") ИЛИ СтрНачинаетсяС(КодТНВЭД, "61")
			ИЛИ СтрНачинаетсяС(КодТНВЭД, "62") ИЛИ СтрНачинаетсяС(КодТНВЭД, "64"))
			И НЕ ЗначениеЗаполнено(ТекущаяСтрока.ЦелевойПол) Тогда
			
			ВывестиСообщение(
				НСтр("ru = 'Табличная часть Товары. Строка: %1. Не заполнен целевой пол.'"),
				ЭтотОбъект,
				"Товары[#].ЦелевойПол",
				ТекущаяСтрока.НомерСтроки,
				Отказ);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
